org/bdd/04_algebra_calculo_relacionales.org
#+title:Algebra Calculo Relacional
#+date: <2020-02-03 Mon>
#+html_head: <title class="title">title</title><link rel="stylesheet" type="text/css" href="/res/org.css"/>
#+INFOJS_OPT: view:overview toc:t mouse:underline buttons:0 path:/res/org-info.js
* Introducción
*** Lenguajes de manipulación de datos (DML)
    Para interactuar con un modelo es necesario utilizar un lenguaje.

    Los lenguajes que permiten extraer información de un modelo de datos se
    denominan lenguajes de manipulación de datos, o DML (Data Manipulation
    Languages).

    #+BEGIN_SRC language

    #+END_SRC

    Los lenguajes procedurales indican un procedimiento a seguir, utilizando
    operaciones que indican cómo manipular las datos.

    Los lenguajes declarativos indican qué resultado se quiere obtener, sin
    especificar cómo hacerlo.

    Los lenguajes procedurales se consideran de más bajo nivel.

*** Lenguajes del modelo relacional
    En el modelo relacional existen distintos DML's, algunos de ellos formales y
    algunos prácticos.

    El lenguage práctico más conocido es SQL (Structured Query Language), y es
    declarativo.

    Los lenguajes formales del modelo relacional son:
    - El álgebra relacional (procedural).
    - El cálculo relacional (declarativo).

* Álgebra Relacional

*** Características

    Es un lenguaje procedural.

    Propuesto por E. Codd en 1970, se lo considera parte integral del modelo
    relacional.

    Su utilidad radica en que:
    - Provee un marco formal de operaciones para el modelo relacional.
    - Se emplea como base para optimizar la ejecución de consultas.

    El álgebra relacional especifica los procedimientos de consulta de datos a
    partir de un conjunto de operaciones.

    Una operación -en el contexto del modelo relacional- es una función cuyos
    operandos son una o más relaciones, y cuyo resultado es también una relación.

    O : R_1× R_2 × ... × R_n → S

    La aridad es la cantidad de operandos que toma una operación.

    Las operaciones del álgebra relacional pueden combinarse entre ellas para formar
    una expresión.

*** Recursos utilizados
    2010 World Cup Dataset
    https://github.com/chinovieza/worldcup2010

    RelaX - Relational algebra calculator
    http://dbis-uibk.github.io/relax/

*** Recursos utilizados: 2010 World Cup Dataset
    Modelo ER simplificado (sin atributos):

    #+BEGIN_SRC dot

    #+END_SRC

    Esquema de base de datos relacional:

    - Continent(id, name)
      - (1, ’Africa’)
    - NationalTeam(id, name, group, short_name, continent)
      - (1, ’South Africa’, ’A’, ’RSA’, 0)
    - Match(id, home, away, match_datetime_gmt, stage)
      - (1, 1, 2, ’2010-06-11 14:00:00’, 1)
    - Player(id, name, birth_date, height, playing_position, local_club,
      national_team, national_team_tshirt)
      - (53, ’Edinson Cavani’, ’1987-02-14’, 188, ’FW’, ’Palermo [ITA]’, 3, 7)
    - Score(id, match_id, team_id, player_id, minute, score_type)
      - (1, 1, 1, 8, ’55’, 1) (Corresponde a la entidad Goal).
    - Stage(id, name)
      - (3, ’Quarter-finals’)

    Asumiremos que “name” es siempre clave candidata.

    Los tipos de score son: 1-normal; 2-penal; 3-tiempo adic.; 4-tiempo supl.; 5-gol
    en contra (se asigna al equipo contrario); 6-gol en serie de penales; 7-gol
    errado en serie de penales (no cuenta como gol).

** Operaciones básicas
*** Selección [ELM16 8.1.1]
    El operador de selección (σ) es un operador unario.

    σ_{cond}:R → S

    Dada una relación R(A_1,A_2, ...,A_n) y una condición que se aplica a cada tupla
    de R, σ_{cond}(R) selecciona aquellas tuplas de R para las cuales la condición
    es verdadera.

    | nombre_película  |  año | nombre_director   | cant_oscars |
    | Kill Bill        | 2003 | Quentin Tarantino |           0 |
    | Django Unchained | 2012 | Quentin Tarantino |           2 |
    | Star Wars III    | 2005 | George Lucas      |           0 |
    | Coco             | 2017 | Lee Unkrich       |           2 |

    σ_{cant_oscars ≥ 1}(Películas)

    | nombre_película  |  año | nombre_director   | cant_oscars |
    | Django Unchained | 2012 | Quentin Tarantino |           2 |
    | Coco             | 2017 | Lee Unkrich       |           2 |

**** Condiciones
     Utilizaremos condiciones atómicas de la forma:
     - A_i A_j
     - A i c, con c ∈ dom(A_i)

     En donde debe ser un operador de comparación:
     - =, \neq
     - >, ≥, <, ≤ (sólo para atributos cuyos dominios están ordenados)

     Una condición se construye combinando condiciones atómicas con los operadores
     lógicos and (∧), or (∨) y not (¬).

     #+BEGIN_SRC language
Ejemplo: World Cup 2010
Seleccionar aquellos jugadores del mundial que pertenecen al club
“Barcelona [ESP]” y nacieron antes de 1990.
     #+END_SRC

     #+BEGIN_SRC language
Respuesta
σ_{(local_club=“Barcelona [ESP]”)∧(birth_date<“1990−01−01”)} (Player)
     #+END_SRC

