bdd/04_algebra_calculo_relacionales.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-01 Fri 11:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Algebra Calculo Relacional</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
<link rel="stylesheet" type="text/css" href="/home/mk/Documents/blogs/org.css"/>
</head>
<body>
<div id="content">
<div id="outline-container-orgebe0c48" class="outline-2">
<h2 id="orgebe0c48">Introducción</h2>
<div class="outline-text-2" id="text-orgebe0c48">
</div>
<div id="outline-container-org82127a3" class="outline-4">
<h4 id="org82127a3">Lenguajes de manipulación de datos (DML)</h4>
<div class="outline-text-4" id="text-org82127a3">
<p>
Para interactuar con un modelo es necesario utilizar un lenguaje.
</p>

<p>
Los lenguajes que permiten extraer información de un modelo de datos se
denominan lenguajes de manipulación de datos, o DML (Data Manipulation
Languages).
</p>

<div class="org-src-container">
<pre class="src src-language">
</pre>
</div>

<p>
Los lenguajes procedurales indican un procedimiento a seguir, utilizando
operaciones que indican cómo manipular las datos.
</p>

<p>
Los lenguajes declarativos indican qué resultado se quiere obtener, sin
especificar cómo hacerlo.
</p>

<p>
Los lenguajes procedurales se consideran de más bajo nivel.
</p>
</div>
</div>

<div id="outline-container-orgcd02b13" class="outline-4">
<h4 id="orgcd02b13">Lenguajes del modelo relacional</h4>
<div class="outline-text-4" id="text-orgcd02b13">
<p>
En el modelo relacional existen distintos DML's, algunos de ellos formales y
algunos prácticos.
</p>

<p>
El lenguage práctico más conocido es SQL (Structured Query Language), y es
declarativo.
</p>

<p>
Los lenguajes formales del modelo relacional son:
</p>
<ul class="org-ul">
<li>El álgebra relacional (procedural).</li>
<li>El cálculo relacional (declarativo).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org324839a" class="outline-2">
<h2 id="org324839a">Álgebra Relacional</h2>
<div class="outline-text-2" id="text-org324839a">
</div>
<div id="outline-container-org5a008ea" class="outline-4">
<h4 id="org5a008ea">Características</h4>
<div class="outline-text-4" id="text-org5a008ea">
<p>
Es un lenguaje procedural.
</p>

<p>
Propuesto por E. Codd en 1970, se lo considera parte integral del modelo
relacional.
</p>

<p>
Su utilidad radica en que:
</p>
<ul class="org-ul">
<li>Provee un marco formal de operaciones para el modelo relacional.</li>
<li>Se emplea como base para optimizar la ejecución de consultas.</li>
</ul>

<p>
El álgebra relacional especifica los procedimientos de consulta de datos a
partir de un conjunto de operaciones.
</p>

<p>
Una operación -en el contexto del modelo relacional- es una función cuyos
operandos son una o más relaciones, y cuyo resultado es también una relación.
</p>

<p>
O : R_1× R_2 × &#x2026; × R_n → S
</p>

<p>
La aridad es la cantidad de operandos que toma una operación.
</p>

<p>
Las operaciones del álgebra relacional pueden combinarse entre ellas para formar
una expresión.
</p>
</div>
</div>

<div id="outline-container-orge97bcec" class="outline-4">
<h4 id="orge97bcec">Recursos utilizados</h4>
<div class="outline-text-4" id="text-orge97bcec">
<p>
2010 World Cup Dataset
<a href="https://github.com/chinovieza/worldcup2010">https://github.com/chinovieza/worldcup2010</a>
</p>

<p>
RelaX - Relational algebra calculator
<a href="http://dbis-uibk.github.io/relax/">http://dbis-uibk.github.io/relax/</a>
</p>
</div>
</div>

<div id="outline-container-orgf9746dc" class="outline-4">
<h4 id="orgf9746dc">Recursos utilizados: 2010 World Cup Dataset</h4>
<div class="outline-text-4" id="text-orgf9746dc">
<p>
Modelo ER simplificado (sin atributos):
</p>

<p>
Esquema de base de datos relacional:
</p>

<ul class="org-ul">
<li>Continent(id, name)
<ul class="org-ul">
<li>(1, ’Africa’)</li>
</ul></li>
<li>NationalTeam(id, name, group, short_name, continent)
<ul class="org-ul">
<li>(1, ’South Africa’, ’A’, ’RSA’, 0)</li>
</ul></li>
<li>Match(id, home, away, match_datetime_gmt, stage)
<ul class="org-ul">
<li>(1, 1, 2, ’2010-06-11 14:00:00’, 1)</li>
</ul></li>
<li>Player(id, name, birth_date, height, playing_position, local_club,
national_team, national_team_tshirt)
<ul class="org-ul">
<li>(53, ’Edinson Cavani’, ’1987-02-14’, 188, ’FW’, ’Palermo [ITA]’, 3, 7)</li>
</ul></li>
<li>Score(id, match_id, team_id, player_id, minute, score_type)
<ul class="org-ul">
<li>(1, 1, 1, 8, ’55’, 1) (Corresponde a la entidad Goal).</li>
</ul></li>
<li>Stage(id, name)
<ul class="org-ul">
<li>(3, ’Quarter-finals’)</li>
</ul></li>
</ul>

<p>
Asumiremos que “name” es siempre clave candidata.
</p>

<p>
Los tipos de score son: 1-normal; 2-penal; 3-tiempo adic.; 4-tiempo supl.; 5-gol
en contra (se asigna al equipo contrario); 6-gol en serie de penales; 7-gol
errado en serie de penales (no cuenta como gol).
</p>
</div>
</div>

<div id="outline-container-org8c95ca9" class="outline-3">
<h3 id="org8c95ca9">Operaciones básicas</h3>
<div class="outline-text-3" id="text-org8c95ca9">
</div>
<div id="outline-container-orgfce11a5" class="outline-4">
<h4 id="orgfce11a5">Selección [ELM16 8.1.1]</h4>
<div class="outline-text-4" id="text-orgfce11a5">
<p>
El operador de selección (σ) es un operador unario.
</p>

<p>
σ<sub>cond</sub>:R → S
</p>

<p>
Dada una relación R(A_1,A_2, &#x2026;,A_n) y una condición que se aplica a cada tupla
de R, σ<sub>cond</sub>(R) selecciona aquellas tuplas de R para las cuales la condición
es verdadera.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-right">año</td>
<td class="org-left">nombre_director</td>
<td class="org-right">cant_oscars</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-right">2003</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-right">2012</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-right">2005</td>
<td class="org-left">George Lucas</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-right">2017</td>
<td class="org-left">Lee Unkrich</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>

<p>
σ<sub>cant_oscars ≥ 1</sub>(Películas)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-right">año</td>
<td class="org-left">nombre_director</td>
<td class="org-right">cant_oscars</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-right">2012</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-right">2017</td>
<td class="org-left">Lee Unkrich</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org9c0d965" class="outline-5">
<h5 id="org9c0d965">Condiciones</h5>
<div class="outline-text-5" id="text-org9c0d965">
<p>
Utilizaremos condiciones atómicas de la forma:
</p>
<ul class="org-ul">
<li>A_i A_j</li>
<li>A i c, con c ∈ dom(A_i)</li>
</ul>

<p>
En donde debe ser un operador de comparación:
</p>
<ul class="org-ul">
<li>=, &ne;</li>
<li>&gt;, ≥, &lt;, ≤ (sólo para atributos cuyos dominios están ordenados)</li>
</ul>

<p>
Una condición se construye combinando condiciones atómicas con los operadores
lógicos and (∧), or (∨) y not (¬).
</p>

<div class="org-src-container">
<pre class="src src-language">Ejemplo: World Cup 2010
Seleccionar aquellos jugadores del mundial que pertenecen al club
“Barcelona [ESP]” y nacieron antes de 1990.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
σ_{(local_club=“Barcelona [ESP]”)∧(birth_date&lt;“1990−01−01”)} (Player)
</pre>
</div>
</div>
</div>
</div>
