org/bdd/04_algebra_calculo_relacionales.org
*** Proyección [ELM16 8.1.2]
    El operador de proyección (π) es también un operador unario.

    π_{L}:R → S

    Dada una relación R(A_1,A_2, ...,A_n) y una lista de atributos L = (L_1,L_2,
    ..., L_k), con L_i ∈ (A_1,A_2, ...,A_n), π_L(R) devuelve una atributos de L en
    R.

    Podemos pensar que lo que hace es proyectar cada tupla de R a un espacio de
    menor dimensión en que sólo se conservan los atributos que están en L.

    | nombre_película  |  año | nombre_director   |
    | Kill Bill        | 2003 | Quentin Tarantino |
    | Django Unchained | 2012 | Quentin Tarantino |
    | Star Wars III    | 2005 | George Lucas      |
    | Coco             | 2017 | Lee Unkrich       |

    π_{nombre_director}(Películas)

    | nombre_director   |
    | Quentin Tarantino |
    | George Lucas      |
    | Lee Unkrich       |

    El orden de los atributos en la relación resultado es el mismo orden en que
    figuran en L.

    El operador de proyección siempre remueve tuplas duplicadas, ya que su resultado
    debe ser también una relación válida.

    #+BEGIN_SRC language
Ejemplo: World Cup 2010
Liste las posiciones de juego de los jugadores.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
π playing_position (Player )
    #+END_SRC

*** Secuencias de operaciones. Asignación (←) [ELM16 8.1.3]
    Supongamos que queremos listar los nombres de los directores
    que han ganado algún Oscar.

    PELÍCULAS
    | nombre_película  |  año | nombre_director   | cant_oscars    |
    | Kill Bill        | 2003 | Quentin Tarantino | 0              |
    | Django Unchained | 2012 | Quentin Tarantino | 2              |
    | Star Wars III    | 2005 | George Lucas      | 0              |
    | Coco             | 2017 | Lee Unkrich       | 2              |
    |                  |      |                   |                |

    Temp ← σ_{cant_oscars>0} (Películas)

    Directores_Oscar ← π nombre_director (Temp)

    Podemos también hacerlo en un único paso:
    Directores_Oscar ← π nombre_director (σ_{cant_oscars>0} (Películas))

    DIRECTORES_OSCAR
    | nombre_director   |
    | Quentin Tarantino |
    | Lee Unkrich       |

*** Redenominación [ELM16 8.1.3]
    El operador de redenominación (ρ) permite modificar los nombres de los atributos
    de una relación y/o el nombre de la relación misma.

    Nos permite preparar el resultado para la realización de una operación
    posterior.

    Dada una relación R(A 1 , A 2 , ..., A n ), un nuevo nombre de relación S y una
    lista de n nombres de atributo (B 1 , B 2 , ..., B n ), ρ S(B 1 ,B 2 ,...,B n )
    (R) produce una relación de nombre S y atributos (B 1 , B 2 , ..., B n ) cuyas
    tuplas coinciden con las tuplas de R.

    ρ S (R) sólo cambia el nombre de la relación R por S.

    PELÍCULAS
    | nombre_película  | cant_oscars |
    | Kill Bill        |           0 |
    | Django Unchained |           2 |
    | Star Wars III    |           0 |
    | Coco             |           2 |

    ρ_{Films(film_name,n_oscars)}(Películas)

    FILMS
    | film_name        | n_oscars |
    | Kill Bill        |        0 |
    | Django Unchained |        2 |
    | Star Wars III    |        0 |
    | Coco             |        2 |

*** Operaciones de conjuntos
**** Unión [ELM16 8.2.1]
     Dadas dos relaciones R(A 1 , A 2 , ..., A n ) y S(B 1 , B 2 , ..., B n ), la
     unión R ∪ S es una relación que contiene a todas las tuplas de R y de S.

     Es necesario que R y S tengan el mismo grado.

     Además, para calcular R ∪ S las relaciones R y S deben coincidir en sus
     atributos en lo que respecta al dominio. Es decir, dom(A i ) = dom(B i ). Esta
     condición se denomina compatibilidad de unión o compatibilidad de tipo.

     Por convención, en la relación resultado el listado de atributos coincide con el
     de R: (A 1 , A 2 , ..., A n ).

     | id1 | nombre1 |
     |   3 | Juan    |
     |   5 | Martín  |
     |  18 | Marta   |

     | id2 | nombre2 |
     |   7 | Marta   |
     |   5 | Martín  |

     Usuarios1 ∪ Usuarios2

     | id1 | nombre1 |
     |   3 | Juan    |
     |   5 | Martín  |
     |  18 | Marta   |
     |   7 | Marta   |

**** Intersección [ELM16 8.2.1]
     Dadas dos relaciones R(A 1 , A 2 , ..., A n ) y S(B 1 , B 2 , ..., B n ), la
     intersección R ∩ S conserva las tuplas que se encuentran presentes tanto en R
     como en S.

     R y S deben tener el mismo grado.

     Al igual que la unión, la intersección requiere compatibilidad de tipo.

     El listado de atributos de la relación resultado será (A 1 , A 2 , ..., A n ).

     | id1 | nombre1 |
     |   3 | Juan    |
     |   5 | Martín  |
     |  18 | Marta   |

     | id2 | nombre2 |
     |   7 | Marta   |
     |   5 | Martín  |

     Usuarios1 ∩ Usuarios2

     | id1 | nombre1 |
     |   5 | Martín  |

