bdd/04_algebra_calculo_relacionales.html

<div id="outline-container-org6b3b092" class="outline-4">
<h4 id="org6b3b092">Proyección [ELM16 8.1.2]</h4>
<div class="outline-text-4" id="text-org6b3b092">
<p>
El operador de proyección (π) es también un operador unario.
</p>

<p>
π<sub>L</sub>:R → S
</p>

<p>
Dada una relación R(A_1,A_2, &#x2026;,A_n) y una lista de atributos L = (L_1,L_2,
&#x2026;, L_k), con L_i ∈ (A_1,A_2, &#x2026;,A_n), π_L(R) devuelve una atributos de L en
R.
</p>

<p>
Podemos pensar que lo que hace es proyectar cada tupla de R a un espacio de
menor dimensión en que sólo se conservan los atributos que están en L.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-right">año</td>
<td class="org-left">nombre_director</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-right">2003</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-right">2012</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-right">2005</td>
<td class="org-left">George Lucas</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-right">2017</td>
<td class="org-left">Lee Unkrich</td>
</tr>
</tbody>
</table>

<p>
π<sub>nombre_director</sub>(Películas)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_director</td>
</tr>

<tr>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">George Lucas</td>
</tr>

<tr>
<td class="org-left">Lee Unkrich</td>
</tr>
</tbody>
</table>

<p>
El orden de los atributos en la relación resultado es el mismo orden en que
figuran en L.
</p>

<p>
El operador de proyección siempre remueve tuplas duplicadas, ya que su resultado
debe ser también una relación válida.
</p>

<div class="org-src-container">
<pre class="src src-language">Ejemplo: World Cup 2010
Liste las posiciones de juego de los jugadores.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
π playing_position (Player )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgff7a5d9" class="outline-4">
<h4 id="orgff7a5d9">Secuencias de operaciones. Asignación (←) [ELM16 8.1.3]</h4>
<div class="outline-text-4" id="text-orgff7a5d9">
<p>
Supongamos que queremos listar los nombres de los directores
que han ganado algún Oscar.
</p>

<p>
PELÍCULAS
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-right">año</td>
<td class="org-left">nombre_director</td>
<td class="org-right">cant_oscars</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-right">2003</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-right">2012</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-right">2005</td>
<td class="org-left">George Lucas</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-right">2017</td>
<td class="org-left">Lee Unkrich</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Temp ← σ<sub>cant_oscars&gt;0</sub> (Películas)
</p>

<p>
Directores_Oscar ← π nombre_director (Temp)
</p>

<p>
Podemos también hacerlo en un único paso:
Directores_Oscar ← π nombre_director (σ<sub>cant_oscars&gt;0</sub> (Películas))
</p>

<p>
DIRECTORES_OSCAR
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_director</td>
</tr>

<tr>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Lee Unkrich</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf7a8f8b" class="outline-4">
<h4 id="orgf7a8f8b">Redenominación [ELM16 8.1.3]</h4>
<div class="outline-text-4" id="text-orgf7a8f8b">
<p>
El operador de redenominación (ρ) permite modificar los nombres de los atributos
de una relación y/o el nombre de la relación misma.
</p>

<p>
Nos permite preparar el resultado para la realización de una operación
posterior.
</p>

<p>
Dada una relación R(A 1 , A 2 , &#x2026;, A n ), un nuevo nombre de relación S y una
lista de n nombres de atributo (B 1 , B 2 , &#x2026;, B n ), ρ S(B 1 ,B 2 ,&#x2026;,B n )
(R) produce una relación de nombre S y atributos (B 1 , B 2 , &#x2026;, B n ) cuyas
tuplas coinciden con las tuplas de R.
</p>

<p>
ρ S (R) sólo cambia el nombre de la relación R por S.
</p>

<p>
PELÍCULAS
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-right">cant_oscars</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>

<p>
ρ<sub>Films(film_name,n_oscars)</sub>(Películas)
</p>

<p>
FILMS
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">film_name</td>
<td class="org-right">n_oscars</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc85f9a2" class="outline-4">
<h4 id="orgc85f9a2">Operaciones de conjuntos</h4>
<div class="outline-text-4" id="text-orgc85f9a2">
</div>
<div id="outline-container-orgb23fe3b" class="outline-5">
<h5 id="orgb23fe3b">Unión [ELM16 8.2.1]</h5>
<div class="outline-text-5" id="text-orgb23fe3b">
<p>
Dadas dos relaciones R(A 1 , A 2 , &#x2026;, A n ) y S(B 1 , B 2 , &#x2026;, B n ), la
unión R ∪ S es una relación que contiene a todas las tuplas de R y de S.
</p>

<p>
Es necesario que R y S tengan el mismo grado.
</p>

<p>
Además, para calcular R ∪ S las relaciones R y S deben coincidir en sus
atributos en lo que respecta al dominio. Es decir, dom(A i ) = dom(B i ). Esta
condición se denomina compatibilidad de unión o compatibilidad de tipo.
</p>

<p>
Por convención, en la relación resultado el listado de atributos coincide con el
de R: (A 1 , A 2 , &#x2026;, A n ).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">id1</td>
<td class="org-left">nombre1</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Juan</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Martín</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">Marta</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">id2</td>
<td class="org-left">nombre2</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Marta</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Martín</td>
</tr>
</tbody>
</table>

<p>
Usuarios1 ∪ Usuarios2
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">id1</td>
<td class="org-left">nombre1</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Juan</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Martín</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">Marta</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Marta</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org748a916" class="outline-5">
<h5 id="org748a916">Intersección [ELM16 8.2.1]</h5>
<div class="outline-text-5" id="text-org748a916">
<p>
Dadas dos relaciones R(A 1 , A 2 , &#x2026;, A n ) y S(B 1 , B 2 , &#x2026;, B n ), la
intersección R ∩ S conserva las tuplas que se encuentran presentes tanto en R
como en S.
</p>

<p>
R y S deben tener el mismo grado.
</p>

<p>
Al igual que la unión, la intersección requiere compatibilidad de tipo.
</p>

<p>
El listado de atributos de la relación resultado será (A 1 , A 2 , &#x2026;, A n ).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">id1</td>
<td class="org-left">nombre1</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Juan</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Martín</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">Marta</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">id2</td>
<td class="org-left">nombre2</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Marta</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Martín</td>
</tr>
</tbody>
</table>

<p>
Usuarios1 ∩ Usuarios2
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">id1</td>
<td class="org-left">nombre1</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Martín</td>
</tr>
</tbody>
</table>
</div>
</div>
