org/bdd/04_algebra_calculo_relacionales.org
**** Diferencia [ELM16 8.2.1]
     Dadas dos relaciones R(A 1 , A 2 , ..., A n ) y S(A 1 , A 2 , ..., A n ), la
     diferencia R − S conserva sólo aquellas tuplas de R que no pertenecen a S.

     R y S deben tener el mismo grado.

     También requiere compatibilidad de tipo.

     El listado de atributos de la relación resultado será (A 1 , A 2 , ..., A n ).

     | id1 | nombre1 |
     |   3 | Juan    |
     |   5 | Martín  |
     |  18 | Marta   |

     | id2 | nombre2 |
     |   7 | Marta   |
     |   5 | Martín  |

     Usuarios1 − Usuarios2

     | id1 | nombre1 |
     |   3 | Juan    |
     |  18 | Marta   |

*** Producto cartesiano [ELM16 8.2.2]
    Dadas dos relaciones R(A 1 , A 2 , ..., A n ) y S(B 1 , B 2 , ..., B m ), el
    producto cartesiano R × S produce una nueva relación T cuyas tuplas son todas
    aquellas de la forma (t 1 , t 2 , ..., t n , t n+1 , t n+2 , ..., t n+m ), con
    (t 1 , t 2 , ..., t n ) ∈ R y (t n+1 , t n+2 , ..., t n+m ) ∈ S.

    El esquema de la relación resultante T es (A 1 , A 2 , ..., A n , B 1 , B 2 ,
    ..., B m ). Salvo...

    ... si algún atributo A i tiene el mismo nombre que un atributo B j. En ese
    caso, la convención será que en el resultado los atributos se llamarán “R.A i ”
    y “S.B j ”. En el caso de estar calculando R × R, llamaremos a los atributos
    R1.A i y R2.A i .

    Es la primera operación hasta ahora que nos permite combinar
    información proveniente de distintas relaciones.

    Aunque generalmente debe ser acompañada de alguna selección
    para reducir las combinaciones del resultado.

    El producto cartesiano no requiere compatibilidad de tipos.

    | nombre_película  | nombre_director   |
    | Kill Bill        | Quentin Tarantino |
    | Django Unchained | Quentin Tarantino |
    | Star Wars III    | George Lucas      |
    | Coco             | Lee Unkrich       |

    | nombre_película | nombre_actor    |
    | Kill Bill       | Uma Thurman     |
    | Star Wars III   | Natalie Portman |

    Películas × Actuaciones

    | Películas.nombre_película | nombre_director   | Actuaciones.nombre_película | nombre_actor    |
    | Kill Bill                 | Quentin Tarantino | Kill Bill                   | Uma Thurman     |
    | Kill Bill                 | Quentin Tarantino | Star Wars III               | Natalie Portman |
    | Django Unchained          | Quentin Tarantino | Kill Bill                   | Uma Thurman     |
    | Django Unchained          | Quentin Tarantino | Star Wars III               | Natalie Portman |
    | Star Wars III             | George Lucas      | Kill Bill                   | Uma Thurman     |
    | Star Wars III             | George Lucas      | Star Wars III               | Natalie Portman |
    | Coco                      | Lee Unkrich       | Kill Bill                   | Uma Thurman     |
    | Coco                      | Lee Unkrich       | Star Wars III               | Natalie Portman |


    ¿Cómo hacemos, dadas las relaciones
    - Películas(nombre_película, nombre_director)
    - Actuaciones(nombre_película, nombre_actor)
    para obtener las tuplas (nombre_película, nombre_director, nombre_actor) que
    representan la coparticipación de actores y directores en películas?

    | nombre_película  | nombre_director   |
    | Kill Bill        | Quentin Tarantino |
    | Django Unchained | Quentin Tarantino |
    | Star Wars III    | George Lucas      |
    | Coco             | Lee Unkrich       |

    | nombre_película | nombre_actor    |
    | Kill Bill       | Uma Thurman     |
    | Star Wars III   | Natalie Portman |

    σ_{Peliculas.nombre_pelicula = Actuaciones.nombre_pelicula}(Películas ×
    Actuaciones)

    | Películas.nombre_película | nombre_director   | Actuaciones.nombre_película | nombre_actor    |
    | Kill Bill                 | Quentin Tarantino | Kill Bill                   | Uma Thurman     |
    | Star Wars III             | George Lucas      | Star Wars III               | Natalie Portman |

    #+BEGIN_SRC language
Ejemplo: World Cup 2010
Liste los países con los que jugó la Selección Argentina.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
LOCAL ← π_{away} (σ_{(home=NT .id)∧(name=“Argentina”)} (Match × ρ_{NT} (NationalTeam)))
AWAY ← π_{home} (σ__{(away =NT .id)∧(name=“Argentina”)} (Match × ρ_{NT} (NationalTeam)))
π_{name} (σ_{away =id} (NationalTeam × (LOCAL ∪ AWAY )))
    #+END_SRC

*** Árboles de consulta [ELM16 8.3.5]
    Para cada expresión del álgebra relacional se puede construir un árbol de
    consulta que representa el orden de ejecución.

    Para el ejemplo anterior sobre el producto cartesiano:

    image

