bdd/04_algebra_calculo_relacionales.html

<div id="outline-container-org5857364" class="outline-5">
<h5 id="org5857364">Diferencia [ELM16 8.2.1]</h5>
<div class="outline-text-5" id="text-org5857364">
<p>
Dadas dos relaciones R(A 1 , A 2 , &#x2026;, A n ) y S(A 1 , A 2 , &#x2026;, A n ), la
diferencia R − S conserva sólo aquellas tuplas de R que no pertenecen a S.
</p>

<p>
R y S deben tener el mismo grado.
</p>

<p>
También requiere compatibilidad de tipo.
</p>

<p>
El listado de atributos de la relación resultado será (A 1 , A 2 , &#x2026;, A n ).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">id1</td>
<td class="org-left">nombre1</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Juan</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Martín</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">Marta</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">id2</td>
<td class="org-left">nombre2</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Marta</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Martín</td>
</tr>
</tbody>
</table>

<p>
Usuarios1 − Usuarios2
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">id1</td>
<td class="org-left">nombre1</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Juan</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">Marta</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org3eb1acd" class="outline-4">
<h4 id="org3eb1acd">Producto cartesiano [ELM16 8.2.2]</h4>
<div class="outline-text-4" id="text-org3eb1acd">
<p>
Dadas dos relaciones R(A 1 , A 2 , &#x2026;, A n ) y S(B 1 , B 2 , &#x2026;, B m ), el
producto cartesiano R × S produce una nueva relación T cuyas tuplas son todas
aquellas de la forma (t 1 , t 2 , &#x2026;, t n , t n+1 , t n+2 , &#x2026;, t n+m ), con
(t 1 , t 2 , &#x2026;, t n ) ∈ R y (t n+1 , t n+2 , &#x2026;, t n+m ) ∈ S.
</p>

<p>
El esquema de la relación resultante T es (A 1 , A 2 , &#x2026;, A n , B 1 , B 2 ,
&#x2026;, B m ). Salvo&#x2026;
</p>

<p>
&#x2026; si algún atributo A i tiene el mismo nombre que un atributo B j. En ese
caso, la convención será que en el resultado los atributos se llamarán “R.A i ”
y “S.B j ”. En el caso de estar calculando R × R, llamaremos a los atributos
R1.A i y R2.A i .
</p>

<p>
Es la primera operación hasta ahora que nos permite combinar
información proveniente de distintas relaciones.
</p>

<p>
Aunque generalmente debe ser acompañada de alguna selección
para reducir las combinaciones del resultado.
</p>

<p>
El producto cartesiano no requiere compatibilidad de tipos.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_director</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-left">Lee Unkrich</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>

<p>
Películas × Actuaciones
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Películas.nombre_película</td>
<td class="org-left">nombre_director</td>
<td class="org-left">Actuaciones.nombre_película</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-left">Lee Unkrich</td>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-left">Lee Unkrich</td>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>


<p>
¿Cómo hacemos, dadas las relaciones
</p>
<ul class="org-ul">
<li>Películas(nombre_película, nombre_director)</li>
<li>Actuaciones(nombre_película, nombre_actor)</li>
</ul>
<p>
para obtener las tuplas (nombre_película, nombre_director, nombre_actor) que
representan la coparticipación de actores y directores en películas?
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_director</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-left">Lee Unkrich</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>

<p>
σ<sub>Peliculas.nombre_pelicula = Actuaciones.nombre_pelicula</sub>(Películas ×
Actuaciones)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Películas.nombre_película</td>
<td class="org-left">nombre_director</td>
<td class="org-left">Actuaciones.nombre_película</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-language">Ejemplo: World Cup 2010
Liste los países con los que jugó la Selección Argentina.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
LOCAL ← π_{away} (σ_{(home=NT .id)∧(name=“Argentina”)} (Match × ρ_{NT} (NationalTeam)))
AWAY ← π_{home} (σ__{(away =NT .id)∧(name=“Argentina”)} (Match × ρ_{NT} (NationalTeam)))
π_{name} (σ_{away =id} (NationalTeam × (LOCAL ∪ AWAY )))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f7cdd4" class="outline-4">
<h4 id="org8f7cdd4">Árboles de consulta [ELM16 8.3.5]</h4>
<div class="outline-text-4" id="text-org8f7cdd4">
<p>
Para cada expresión del álgebra relacional se puede construir un árbol de
consulta que representa el orden de ejecución.
</p>

<p>
Para el ejemplo anterior sobre el producto cartesiano:
</p>

<p>
image
</p>
</div>
</div>
