org/bdd/04_algebra_calculo_relacionales.org
*** Junta [ELM16 8.3.1]
    La operación de junta combina un producto cartesiano con una selección. Dadas
    dos relaciones R(A 1 , A 2 , ..., A n ) y S(B 1 , B 2 , ..., B m ) y una
    condición, la junta R ./ cond S selecciona del producto cartesiano R × S las
    tuplas que cumplen la condición.

    No se admite cualquier tipo de condición de selección, sino sólo
    la conjunción de operaciones atómicas que incluyen columnas de
    ambas relaciones, es decir, de la forma:
    - A_i B_j

    En donde debe ser un operador de comparación:
    - =, \neq
    - >, ≥, <, ≤ (sólo para atributos cuyos dominios están ordenados)

    Una condición se construye entonces combinando operaciones atómicas con el
    operador lógico and (∧).

    Ahora la combinación de Películas y Actuaciones se hace mucho más sencilla:

    | nombre_película  | nombre_director   |
    | Kill Bill        | Quentin Tarantino |
    | Django Unchained | Quentin Tarantino |
    | Star Wars III    | George Lucas      |
    | Coco             | Lee Unkrich       |

    | nombre_película | nombre_actor    |
    | Kill Bill       | Uma Thurman     |
    | Star Wars III   | Natalie Portman |

    (Películas _{nombre_pelicula=nombre_pelicula}Actuaciones)

    | Películas.nombre_película | nombre_director   | Actuaciones.nombre_película | nombre_actor    |
    | Kill Bill                 | Quentin Tarantino | Kill Bill                   | Uma Thurman     |
    | Star Wars III             | George Lucas      | Star Wars III               | Natalie Portman |

    #+BEGIN_SRC language
Ejemplo: World Cup 2010
Obtenga el listado de los nombres de los jugadores de la Selección Argentina.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
PLAYER_TEAM ← NationalTeam ./ _{id=team_id} Player
π_{Player.name} (σ__{NationalTeam.name=“Argentina”} (PLAYER_TEAM))
    #+END_SRC

**** Tipos particulares de junta [ELM16 8.3.2]
     El caso más general de operación de junta también se denomina junta theta (theta
     join).

     Cuando la junta sólo utiliza comparaciones de igualdad en sus condiciones
     atómicas, se denomina junta por igual (equijoin).

     En la junta por igual, el resultado dispondrá de pares de atributos distintos
     que poseerán información redundante. Para librarse de uno de ellos, se define la
     junta natural.

**** Junta Natural

     Para realizar una junta natural entre dos relaciones en reemplazo de una junta
     por igual, las mismas deben estar preparadas de manera que los pares de
     atributos (A i , B j ) de cada condición atómica tengan el mismo nombre en una y
     otra relación. El resultado dispondrá de uno sólo de los atributos, conservando
     su nombre.

     La junta natural entre dos relaciones R y S se simboliza R ∗ S.

     ¡Atención! En la junta natural no se especifican las condiciones, por lo tanto
     todo par de atributos de igual nombre en una y otra relación será comparado por
     igual en la condición de selección implícita.

     Los atributos comparados en una junta se denominan atributos de junta.

     Volviendo al caso de las Películas y Actuaciones:
     - Películas(nombre_película, nombre_director)
     - Actuaciones(nombre_película, nombre_actor)

     Las relaciones ya están preparadas para una junta natural.


     | nombre_película  | nombre_director   |
     | Kill Bill        | Quentin Tarantino |
     | Django Unchained | Quentin Tarantino |
     | Star Wars III    | George Lucas      |
     | Coco             | Lee Unkrich       |

     | nombre_película | nombre_actor    |
     | Kill Bill       | Uma Thurman     |
     | Star Wars III   | Natalie Portman |

     (Películas * Actuaciones)

     | nombre_película | nombre_director   | nombre_actor    |
     | Kill Bill       | Quentin Tarantino | Uma Thurman     |
     | Star Wars III   | George Lucas      | Natalie Portman |


     #+BEGIN_SRC language
Ejemplo: RENAPER
Personas(DNI, nombre, género, fecha_nacimiento)
HijoDe(DNI_padre, DNI_hijo)
CasadaCon(DNI1, DNI2, fecha_matrimonio)

Liste a todos los hijos de “Abraham Simpson” (suponga que no hay dos
personas con ese nombre).
     #+END_SRC

     #+BEGIN_SRC language
Respuesta
PADRE ← ρ DNI_padre (π DNI (σ nombre=“Abraham Simpson” (Personas)))
HIJOS ← ρ DNI_hijo,nombre (π DNI,nombre (Personas))
π DNI_hijo,nombre (PADRE * HijoDe * HIJOS)
     #+END_SRC

