bdd/04_algebra_calculo_relacionales.html

<div id="outline-container-org052be02" class="outline-4">
<h4 id="org052be02">Junta [ELM16 8.3.1]</h4>
<div class="outline-text-4" id="text-org052be02">
<p>
La operación de junta combina un producto cartesiano con una selección. Dadas
dos relaciones R(A 1 , A 2 , &#x2026;, A n ) y S(B 1 , B 2 , &#x2026;, B m ) y una
condición, la junta R ./ cond S selecciona del producto cartesiano R × S las
tuplas que cumplen la condición.
</p>

<p>
No se admite cualquier tipo de condición de selección, sino sólo
la conjunción de operaciones atómicas que incluyen columnas de
ambas relaciones, es decir, de la forma:
</p>
<ul class="org-ul">
<li>A_i B_j</li>
</ul>

<p>
En donde debe ser un operador de comparación:
</p>
<ul class="org-ul">
<li>=, &ne;</li>
<li>&gt;, ≥, &lt;, ≤ (sólo para atributos cuyos dominios están ordenados)</li>
</ul>

<p>
Una condición se construye entonces combinando operaciones atómicas con el
operador lógico and (∧).
</p>

<p>
Ahora la combinación de Películas y Actuaciones se hace mucho más sencilla:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_director</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-left">Lee Unkrich</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>

<p>
(Películas _{nombre_pelicula=nombre_pelicula}Actuaciones)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Películas.nombre_película</td>
<td class="org-left">nombre_director</td>
<td class="org-left">Actuaciones.nombre_película</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-language">Ejemplo: World Cup 2010
Obtenga el listado de los nombres de los jugadores de la Selección Argentina.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
PLAYER_TEAM ← NationalTeam ./ _{id=team_id} Player
π_{Player.name} (σ__{NationalTeam.name=“Argentina”} (PLAYER_TEAM))
</pre>
</div>
</div>

<div id="outline-container-org6448284" class="outline-5">
<h5 id="org6448284">Tipos particulares de junta [ELM16 8.3.2]</h5>
<div class="outline-text-5" id="text-org6448284">
<p>
El caso más general de operación de junta también se denomina junta theta (theta
join).
</p>

<p>
Cuando la junta sólo utiliza comparaciones de igualdad en sus condiciones
atómicas, se denomina junta por igual (equijoin).
</p>

<p>
En la junta por igual, el resultado dispondrá de pares de atributos distintos
que poseerán información redundante. Para librarse de uno de ellos, se define la
junta natural.
</p>
</div>
</div>

<div id="outline-container-orgb4996d6" class="outline-5">
<h5 id="orgb4996d6">Junta Natural</h5>
<div class="outline-text-5" id="text-orgb4996d6">
<p>
Para realizar una junta natural entre dos relaciones en reemplazo de una junta
por igual, las mismas deben estar preparadas de manera que los pares de
atributos (A i , B j ) de cada condición atómica tengan el mismo nombre en una y
otra relación. El resultado dispondrá de uno sólo de los atributos, conservando
su nombre.
</p>

<p>
La junta natural entre dos relaciones R y S se simboliza R ∗ S.
</p>

<p>
¡Atención! En la junta natural no se especifican las condiciones, por lo tanto
todo par de atributos de igual nombre en una y otra relación será comparado por
igual en la condición de selección implícita.
</p>

<p>
Los atributos comparados en una junta se denominan atributos de junta.
</p>

<p>
Volviendo al caso de las Películas y Actuaciones:
</p>
<ul class="org-ul">
<li>Películas(nombre_película, nombre_director)</li>
<li>Actuaciones(nombre_película, nombre_actor)</li>
</ul>

<p>
Las relaciones ya están preparadas para una junta natural.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_director</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-left">Lee Unkrich</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>

<p>
(Películas * Actuaciones)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_director</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-language">Ejemplo: RENAPER
Personas(DNI, nombre, género, fecha_nacimiento)
HijoDe(DNI_padre, DNI_hijo)
CasadaCon(DNI1, DNI2, fecha_matrimonio)

Liste a todos los hijos de “Abraham Simpson” (suponga que no hay dos
personas con ese nombre).
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
PADRE ← ρ DNI_padre (π DNI (σ nombre=“Abraham Simpson” (Personas)))
HIJOS ← ρ DNI_hijo,nombre (π DNI,nombre (Personas))
π DNI_hijo,nombre (PADRE * HijoDe * HIJOS)
</pre>
</div>
</div>
</div>
</div>
