org/bdd/04_algebra_calculo_relacionales.org
*** División [ELM16 8.3.4]
    Esta vez, primero el ejemplo...

    Nos interesa saber qué alumnos aprobaron los 3 TPs.

    | alumno | TP | nota |
    | Pedro  |  1 |    7 |
    | Pedro  |  3 |    2 |
    | Juan   |  1 |    3 |
    | Juan   |  2 |    6 |
    | Juan   |  3 |    8 |
    | Walter |  1 |    4 |
    | Walter |  2 |    9 |
    | Walter |  3 |    8 |

    →

    | alumno | TP |
    | Pedro  |  1 |
    | Juan   |  2 |
    | Juan   |  3 |
    | Walter |  1 |
    | Walter |  2 |
    | Walter |  3 |

    REQUISITOS
    | TP |
    |  1 |
    |  2 |
    |  3 |

    (Aprobados ÷ Requisitos)

    | alumno |
    | Walter |


    Es una operación inversa al producto cartesiano.

    Partimos de una relación R(A 1 , A 2 , ..., A n ) y una relación S(B 1 , B 2 ,
    ..., B m ) cuyos atributos están incluídos en los de R.

    Llamaremos A = {A 1 , A 2 , ..., A n } y B = {B 1 , B 2 , ..., B m }. Entonces B
    ⊂ A.

    Llamaremos Y = A − B.

    Se define entonces la división R ÷ S como la relación T (Y ) cuyas tuplas t
    cumplen que:
    1. t pertenece a π Y (R).
    2. Para cada tupla t S ∈ S existe una tupla t R ∈ R tal que t R [Y ] = t y t R
       [B] = t S .

    Propiedad: T es la relación de mayor cardinalidad posible contenida en π Y (R) y
    que cumple que T ∗ S ⊂ R.


    #+BEGIN_SRC language
Ejemplo: Tenistas
Tenistas(nombre_tenista, país, altura, diestro)
(‘Novak Djokovic’, ‘Serbia’, 1.88, True)
Torneos(nombre_torneo, tipo_torneo)
(‘Abierto de Australia’, ‘Grand Slam’)
Campeones(nombre_tenista, nombre_torneo, modalidad, año)
(‘Juan Martín del Potro’, ‘Torneo de Estocolmo’, ‘Single’, 2016)
Liste a aquellos tenistas que hayan ganado todos los torneos de tipo “Grand
Slam” existentes al menos una vez.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
TORNEOS_GRAND_SLAM ← π nombre_torneo (σ tipo_torneo=“Grand Slam” (Torneos))
π nombre_tenista,nombre_torneo (Campeones)÷TORNEOS_GRAND_SLAM
    #+END_SRC

*** Conjuntos completos de operadores [ELM16 8.3.3]
    Hemos definido una serie de operadores básicos del álgebra relacional: σ, π, ρ,
    ∪, ∩, −, ×, ./, ∗, ÷.

    Sin embargo, existen subconjuntos de ellos que tienen la misma capacidad de
    expresión que todo el conjunto.

    A dichos subconjuntos se los denomina conjuntos completos de operadores.

    {σ, π, ρ, ∪, −, ×} forman un conjunto completo de operadores.

    #+BEGIN_SRC language
¿Cómo se demuestra?
Mostrando que cada uno de los operadores restantes puede
construirse a partir de estos seis.
    #+END_SRC

** Operaciones adicionales: Junta externa
*** Operaciones adicionales [ELM16 8.4]
    Existen operaciones frecuentes de bases de datos que no pueden
    ser expresadas en el álgebra relacional básica.

    Se han propuesto numerosos operadores para extender el
    álgebra relacional, entre ellos:
    - La proyección generalizada.
    - La agregación.
    - La junta externa.

    Sólo presentaremos aquí la junta externa.

*** Junta externa
    Volvamos al ejemplo de las películas y los actores.

    PELÍCULAS
    | nombre_película  | nombre_director   |
    | Kill Bill        | Quentin Tarantino |
    | Django Unchained | Quentin Tarantino |
    | Star Wars III    | George Lucas      |
    | Coco             | Lee Unkrich       |

    ACTUACIONES
    | nombre_película | nombre_actor    |
    | Kill Bill       | Uma Thurman     |
    | Star Wars III   | Natalie Portman |

    (Películas ./ _{nombre_pelicula=nombre_pelicula} Actuaciones)

    | Películas.nombre_película | nombre_director   | Actuaciones.nombre_película | nombre_actor    |
    | Kill Bill                 | Quentin Tarantino | Kill Bill                   | Uma Thurman     |
    | Star Wars III             | George Lucas      | Star Wars III               | Natalie Portman |

    El resultado muestra las combinaciones de director y actor que trabajaron
    juntos, pero descarta las tuplas de la relación izquierda con las cuales no se
    combina ninguna tupla de la derecha.

    La junta externa evita que eso suceda, asegurando que las tuplas de una o ambas
    relaciones estén presentes en el resultado, aún cuando no puedan combinarse con
    ninguna tupla de la otra.

    Existen 3 tipos de junta externa:
    - Junta externa izquierda (R ./ S)
    - Junta externa derecha (R ./ S)
    - Junta externa completa (R ./ S)

    Dadas dos relaciones R(A 1 , A 2 , ..., A n ) y S(B 1 , B 2 , ..., B m ) y una
    condición, la junta externa R[ ./, ./ , ./ ] cond S selecciona del producto R ×
    S las tuplas que cumplen la condición, y añade...
    - ...una tupla (t[A 1 , t[A 2 ], ..., t[A n ], NULL, NULL, ..., NULL) de
      dimensión n + m por cada tupla de t ∈ R que no se encuentra en la proyección
      sobre (A 1 , A 2 , ..., A n ) (Junta externa izquierda, ./).
    - ...una tupla (NULL, NULL, ..., NULL, t[B 1 , t[B 2 ], ..., t[B m ]) de
      dimensión n + m por cada tupla de t ∈ S que no se encuentra en la proyección
      sobre (B 1 , B 2 , ..., B m ) (Junta externa derecha, ./ ).
    - ...ambos tipos de tuplas descriptos (Junta externa completa, ./ ).
** Ejercicios
   #+BEGIN_SRC language
Ejercicio 1
Liste el nombre de los continentes que no fueron representados
por ningún equipo en los cuartos de final del Mundial.
   #+END_SRC

   #+BEGIN_SRC language
Ejercicio 2
Liste el nombre de los jugadores que marcaron al menos 3 goles
durante el Mundial.
   #+END_SRC

   #+BEGIN_SRC language
Ejercicio 3
Liste el nombre y selección nacional de el/los jugadores más altos
del Mundial.
   #+END_SRC
* Cálculo Relacional
** Cálculo Relacional de Tuplas
