bdd/04_algebra_calculo_relacionales.html

<div id="outline-container-orgab7082f" class="outline-4">
<h4 id="orgab7082f">División [ELM16 8.3.4]</h4>
<div class="outline-text-4" id="text-orgab7082f">
<p>
Esta vez, primero el ejemplo&#x2026;
</p>

<p>
Nos interesa saber qué alumnos aprobaron los 3 TPs.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">alumno</td>
<td class="org-right">TP</td>
<td class="org-right">nota</td>
</tr>

<tr>
<td class="org-left">Pedro</td>
<td class="org-right">1</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">Pedro</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Juan</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Juan</td>
<td class="org-right">2</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">Juan</td>
<td class="org-right">3</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">Walter</td>
<td class="org-right">1</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">Walter</td>
<td class="org-right">2</td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-left">Walter</td>
<td class="org-right">3</td>
<td class="org-right">8</td>
</tr>
</tbody>
</table>

<p>
→
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">alumno</td>
<td class="org-right">TP</td>
</tr>

<tr>
<td class="org-left">Pedro</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Juan</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Juan</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Walter</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Walter</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Walter</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>

<p>
REQUISITOS
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">TP</td>
</tr>

<tr>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">3</td>
</tr>
</tbody>
</table>

<p>
(Aprobados ÷ Requisitos)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">alumno</td>
</tr>

<tr>
<td class="org-left">Walter</td>
</tr>
</tbody>
</table>


<p>
Es una operación inversa al producto cartesiano.
</p>

<p>
Partimos de una relación R(A 1 , A 2 , &#x2026;, A n ) y una relación S(B 1 , B 2 ,
&#x2026;, B m ) cuyos atributos están incluídos en los de R.
</p>

<p>
Llamaremos A = {A 1 , A 2 , &#x2026;, A n } y B = {B 1 , B 2 , &#x2026;, B m }. Entonces B
⊂ A.
</p>

<p>
Llamaremos Y = A − B.
</p>

<p>
Se define entonces la división R ÷ S como la relación T (Y ) cuyas tuplas t
cumplen que:
</p>
<ol class="org-ol">
<li>t pertenece a π Y (R).</li>
<li>Para cada tupla t S ∈ S existe una tupla t R ∈ R tal que t R [Y ] = t y t R
[B] = t S .</li>
</ol>

<p>
Propiedad: T es la relación de mayor cardinalidad posible contenida en π Y (R) y
que cumple que T ∗ S ⊂ R.
</p>


<div class="org-src-container">
<pre class="src src-language">Ejemplo: Tenistas
Tenistas(nombre_tenista, país, altura, diestro)
(‘Novak Djokovic’, ‘Serbia’, 1.88, True)
Torneos(nombre_torneo, tipo_torneo)
(‘Abierto de Australia’, ‘Grand Slam’)
Campeones(nombre_tenista, nombre_torneo, modalidad, año)
(‘Juan Martín del Potro’, ‘Torneo de Estocolmo’, ‘Single’, 2016)
Liste a aquellos tenistas que hayan ganado todos los torneos de tipo “Grand
Slam” existentes al menos una vez.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
TORNEOS_GRAND_SLAM ← π nombre_torneo (σ tipo_torneo=“Grand Slam” (Torneos))
π nombre_tenista,nombre_torneo (Campeones)÷TORNEOS_GRAND_SLAM
</pre>
</div>
</div>
</div>

<div id="outline-container-orga579ed5" class="outline-4">
<h4 id="orga579ed5">Conjuntos completos de operadores [ELM16 8.3.3]</h4>
<div class="outline-text-4" id="text-orga579ed5">
<p>
Hemos definido una serie de operadores básicos del álgebra relacional: σ, π, ρ,
∪, ∩, −, ×, ./, ∗, ÷.
</p>

<p>
Sin embargo, existen subconjuntos de ellos que tienen la misma capacidad de
expresión que todo el conjunto.
</p>

<p>
A dichos subconjuntos se los denomina conjuntos completos de operadores.
</p>

<p>
{σ, π, ρ, ∪, −, ×} forman un conjunto completo de operadores.
</p>

<div class="org-src-container">
<pre class="src src-language">¿Cómo se demuestra?
Mostrando que cada uno de los operadores restantes puede
construirse a partir de estos seis.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb505d23" class="outline-3">
<h3 id="orgb505d23">Operaciones adicionales: Junta externa</h3>
<div class="outline-text-3" id="text-orgb505d23">
</div>
<div id="outline-container-org64722ea" class="outline-4">
<h4 id="org64722ea">Operaciones adicionales [ELM16 8.4]</h4>
<div class="outline-text-4" id="text-org64722ea">
<p>
Existen operaciones frecuentes de bases de datos que no pueden
ser expresadas en el álgebra relacional básica.
</p>

<p>
Se han propuesto numerosos operadores para extender el
álgebra relacional, entre ellos:
</p>
<ul class="org-ul">
<li>La proyección generalizada.</li>
<li>La agregación.</li>
<li>La junta externa.</li>
</ul>

<p>
Sólo presentaremos aquí la junta externa.
</p>
</div>
</div>

<div id="outline-container-orgfc8299b" class="outline-4">
<h4 id="orgfc8299b">Junta externa</h4>
<div class="outline-text-4" id="text-orgfc8299b">
<p>
Volvamos al ejemplo de las películas y los actores.
</p>

<p>
PELÍCULAS
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_director</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-left">Quentin Tarantino</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
</tr>

<tr>
<td class="org-left">Coco</td>
<td class="org-left">Lee Unkrich</td>
</tr>
</tbody>
</table>

<p>
ACTUACIONES
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>

<p>
(Películas ./ _{nombre_pelicula=nombre_pelicula} Actuaciones)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Películas.nombre_película</td>
<td class="org-left">nombre_director</td>
<td class="org-left">Actuaciones.nombre_película</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">George Lucas</td>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>

<p>
El resultado muestra las combinaciones de director y actor que trabajaron
juntos, pero descarta las tuplas de la relación izquierda con las cuales no se
combina ninguna tupla de la derecha.
</p>

<p>
La junta externa evita que eso suceda, asegurando que las tuplas de una o ambas
relaciones estén presentes en el resultado, aún cuando no puedan combinarse con
ninguna tupla de la otra.
</p>

<p>
Existen 3 tipos de junta externa:
</p>
<ul class="org-ul">
<li>Junta externa izquierda (R ./ S)</li>
<li>Junta externa derecha (R ./ S)</li>
<li>Junta externa completa (R ./ S)</li>
</ul>

<p>
Dadas dos relaciones R(A 1 , A 2 , &#x2026;, A n ) y S(B 1 , B 2 , &#x2026;, B m ) y una
condición, la junta externa R[ ./, ./ , ./ ] cond S selecciona del producto R ×
S las tuplas que cumplen la condición, y añade&#x2026;
</p>
<ul class="org-ul">
<li>&#x2026;una tupla (t[A 1 , t[A 2 ], &#x2026;, t[A n ], NULL, NULL, &#x2026;, NULL) de
dimensión n + m por cada tupla de t ∈ R que no se encuentra en la proyección
sobre (A 1 , A 2 , &#x2026;, A n ) (Junta externa izquierda, ./).</li>
<li>&#x2026;una tupla (NULL, NULL, &#x2026;, NULL, t[B 1 , t[B 2 ], &#x2026;, t[B m ]) de
dimensión n + m por cada tupla de t ∈ S que no se encuentra en la proyección
sobre (B 1 , B 2 , &#x2026;, B m ) (Junta externa derecha, ./ ).</li>
<li>&#x2026;ambos tipos de tuplas descriptos (Junta externa completa, ./ ).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3b4c9b2" class="outline-3">
<h3 id="org3b4c9b2">Ejercicios</h3>
<div class="outline-text-3" id="text-org3b4c9b2">
<div class="org-src-container">
<pre class="src src-language">Ejercicio 1
Liste el nombre de los continentes que no fueron representados
por ningún equipo en los cuartos de final del Mundial.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Ejercicio 2
Liste el nombre de los jugadores que marcaron al menos 3 goles
durante el Mundial.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Ejercicio 3
Liste el nombre y selección nacional de el/los jugadores más altos
del Mundial.
</pre>
</div>
</div>
</div>
</div>
