org/bdd/04_algebra_calculo_relacionales.org
*** Predicados y operaciones [ELM16 8.6; SILB10 6.2; CONN15 5.2.1]
    En el cálculo relacional de tuplas las variables representan tuplas.

    Un predicado simple es una función de una tupla o de atributos de tuplas, cuyo
    resultado es un valor de verdad (V ó F). Se admiten como predicados simples:
    - R(t), en donde R es una relación
    - t 1 .A i t 2 .A j
    - t.A i c, con c ∈ dom(A i )
    - En donde debe ser un operador de comparación:
      - =, \neq
      - >, ≥, <, ≤ (sólo para atributos cuyos dominios están ordenados)

    Las operaciones entre predicados admitidas son ∧, ∨, ¬.

    #+BEGIN_SRC language
Una expresión del cálculo relacional de tuplas tiene la forma:
{t 1 .A 11 , t 1 .A 12 , ..., t 1 .A 1k 1 , ..., t n .A nk n |p(t 1 , t 2 , ..., t n , t n+1 , ..., t n+m )},
en donde p es un predicado válido. {t 1 , t 2 , ..., t n } deben ser
variables libres, y {t n+1 , t n+2 , ..., t n+m } deben ser variables ligadas.
    #+END_SRC

*** Ejemplos
    #+BEGIN_SRC language
Ejemplo: World Cup 2010
Liste los nombres de los países que jugaron el Mundial 2010.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
{n.name|NationalTeam(n)}
    #+END_SRC

    #+BEGIN_SRC language
Ejemplo: World Cup 2010
Liste los nombres de los jugadores nacidos antes de 1980.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
{p.name|Player (p) ∧ p.date_birth <1980-01-01}
    #+END_SRC

*** Cuantificadores [ELM16 8.6.3; ELM16 8.6.6]
    Pero, ¿cómo hacemos si queremos listar a los jugadores que hicieron algún gol
    durante el mundial?

    Necesitamos de los cuantificadores.
    - Cuantificador universal: (∀t)p(t). Es verdadero si para cualquier tupla t el
      predicado p(t) es verdadero.
    - Cuantificador existencial: (∃t)p(t). Es verdadero si existe al menos una tupla
      t para la cual el predicado p(t) es verdadero.

    El listado de los nombres de los jugadores que hicieron goles se obtiene como:

    #+BEGIN_SRC language
Respuesta
{p.name|Player (p) ∧ (∃s)(Score(s) ∧ s.player _id = p.id)}
    #+END_SRC

    Atención! Una variable que fue cuantificada no puede aparecer seleccionada en el
    lado izquierdo de la barra (|), y toda variable que aparece sólo en el lado
    derecho debe estar cuantificada.
    - Las variables que fueron cuantificadas son variables ligadas.
    - Las variables que no fueron cuantificadas son variables libres.

    Reiteramos:

    #+BEGIN_SRC language
Una expresión del cálculo relacional de tuplas tiene la forma:
{t 1 .A 11 , t 1 .A 12 , ..., t 1 .A 1k 1 , ..., t n .A nk n |p(t 1 , t 2 , ..., t n , t n+1 , ..., t n+m )},
en donde p es un predicado válido. {t 1 , t 2 , ..., t n } deben ser
variables libres, y {t n+1 , t n+2 , ..., t n+m } deben ser variables ligadas.
    #+END_SRC

    #+BEGIN_SRC language
Ejemplo: World Cup 2010
Liste los nombres de los jugadores de la Selección Española.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
{p.name|Player (p) ∧ (∃n)(NationalTeam(n)∧n.id = p.national_team ∧ n.name = “Spain”)}
    #+END_SRC

    #+BEGIN_SRC language
Ejemplo: World Cup 2010
Liste el nombre del jugador más anciano del Mundial.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
{p.name|Player (p) ∧ (∀θ)(¬Player (θ)∨θ.birth_date ≥ p.birth_date)}
    #+END_SRC

    Observemos que el cuantificador ∀θ necesita típicamente de una negación dentro
    de su expresión, para restringir el universo de θ’s sobre los que requerimos que
    la expresión sea verdadera. De lo contrario, el resultado estará vacío.

*** Expresiones seguras [ELM16 8.6.8; SILB10 6.2.3]
    No toda expresión válida del cálculo de tuplas es una expresión segura (safe
    expression).

    Por ejemplo, la expresión...
    #+BEGIN_SRC language
{p.name|¬Player (p)}
    #+END_SRC

    ... no es una expresión segura. Producirá una cantidad infinita de tuplas con
    valores como “safsq” o 57.

    Una expresión segura es aquella que garantiza formalmente que producirá una
    cantidad finita de tuplas.

    Puede probarse que ésto es equivalente a garantizar que los valores de los
    atributos del resultado son parte del dominio de la expresión.

    Ejemplos:
    - {p 1 .nombre|(∃p 2 )(Persona(p 2 ) ∧ p 2 .edad = p 1 .edad)}
      - X Expresión no segura
      - Probablemente queríamos
        - {p 1 .nombre|Persona(p 1 ) ∧ (∃p 2 )(Persona(p 2 ) ∧ p 2 .edad = p 1 .edad)}
    - {p 1 .nombre|Empleado(p 1 ) ∧ (6 ∃p 2 )(Empleado(p 2 ) ∧ p 2 .sueldo > p 1 .sueldo)}
      - Expresión segura
    - {t.nombre|¬((Cliente(t) ∧ Proveedor (t))}
      - Expresión no segura
      - Probablemente queríamos
        - {t.nombre|(Cliente(t) ∨ Proveedor (t)) ∧ ¬(Cliente(t) ∧ Proveedor (t))}

    Recomendación: Cuidado cuando usamos cuantificadores ó negamos predicados!

*** Ejercicio: Tenistas
    #+BEGIN_SRC language
Tenistas(nombre_tenista, país, altura, diestro)
(‘Novak Djokovic’, ‘Serbia’, 1.88, True)
Torneos(nombre_torneo, tipo_torneo)
(‘Abierto de Australia’, ‘Grand Slam’)
Campeones(nombre_tenista, nombre_torneo, modalidad, año)
(‘Juan Martín del Potro’, ‘Torneo de Estocolmo’, ‘Single’, 2016)

Liste los nombres de los tenistas que ganaron todos los torneos de Grand Slam.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
{c.nombre_tenista|Campeones(c)∧
(∀t)(¬Torneos(t) ∨ t.tipo_torneo 6 = “Grand Slam”∨
(∃c 2 )(Campeones(c 2 )∧
c 2 .nombre_tenista = c.nombre_tenista∧
c 2 .nombre_torneo = t.nombre_torneo))}
    #+END_SRC

** Cálculo Relacional de Dominios
*** Predicados, operaciones y cuantificadores [ELM16 8.7]
    En el cálculo relacional de dominios las variables representan dominios, es
    decir que hacen referencia a los atributos.

    Un predicado simple es una función de un conjunto de dominios, cuyo resultado es
    un valor de verdad (V ó F). Se admiten como predicados simples:
    - R(x 1 , x 2 , ..., x n ), en donde R(A 1 , A 2 , ..., A n ) es una relación
    - x i x j
    - x i c, con c ∈ dom(A i )
    - En donde debe ser un operador de comparación:
      - =, \neq
      - >, ≥, <, ≤ (sólo para atributos cuyos dominios están ordenados)

    Las operaciones entre predicados admitidas son ∧, ∨, ¬.

    Se utilizan los cuantificadores con las mismas reglas que en el
    CRT.

    #+BEGIN_SRC language
Una expresión del cálculo relacional de dominios tiene la forma:
{x 1 , x 2 , ..., x n |p(x 1 , x 2 , ..., x n , x n+1 , ..., x n+m )},
en donde p es un predicado válido. {x 1 , x 2 , ..., x n } deben ser
variables libres, y {x n+1 , x n+2 , ..., x n+m } deben ser variables
ligadas.
    #+END_SRC

