bdd/04_algebra_calculo_relacionales.html
<div id="outline-container-orgbe5d883" class="outline-2">
<h2 id="orgbe5d883">Cálculo Relacional</h2>
<div class="outline-text-2" id="text-orgbe5d883">
</div>
<div id="outline-container-org077aa56" class="outline-3">
<h3 id="org077aa56">Cálculo Relacional de Tuplas</h3>
<div class="outline-text-3" id="text-org077aa56">
</div>
<div id="outline-container-orged784a0" class="outline-4">
<h4 id="orged784a0">Predicados y operaciones [ELM16 8.6; SILB10 6.2; CONN15 5.2.1]</h4>
<div class="outline-text-4" id="text-orged784a0">
<p>
En el cálculo relacional de tuplas las variables representan tuplas.
</p>

<p>
Un predicado simple es una función de una tupla o de atributos de tuplas, cuyo
resultado es un valor de verdad (V ó F). Se admiten como predicados simples:
</p>
<ul class="org-ul">
<li>R(t), en donde R es una relación</li>
<li>t 1 .A i t 2 .A j</li>
<li>t.A i c, con c ∈ dom(A i )</li>
<li>En donde debe ser un operador de comparación:
<ul class="org-ul">
<li>=, &ne;</li>
<li>&gt;, ≥, &lt;, ≤ (sólo para atributos cuyos dominios están ordenados)</li>
</ul></li>
</ul>

<p>
Las operaciones entre predicados admitidas son ∧, ∨, ¬.
</p>

<div class="org-src-container">
<pre class="src src-language">Una expresión del cálculo relacional de tuplas tiene la forma:
{t 1 .A 11 , t 1 .A 12 , ..., t 1 .A 1k 1 , ..., t n .A nk n |p(t 1 , t 2 , ..., t n , t n+1 , ..., t n+m )},
en donde p es un predicado válido. {t 1 , t 2 , ..., t n } deben ser
variables libres, y {t n+1 , t n+2 , ..., t n+m } deben ser variables ligadas.
</pre>
</div>
</div>
</div>

<div id="outline-container-org2834f4f" class="outline-4">
<h4 id="org2834f4f">Ejemplos</h4>
<div class="outline-text-4" id="text-org2834f4f">
<div class="org-src-container">
<pre class="src src-language">Ejemplo: World Cup 2010
Liste los nombres de los países que jugaron el Mundial 2010.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
{n.name|NationalTeam(n)}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Ejemplo: World Cup 2010
Liste los nombres de los jugadores nacidos antes de 1980.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
{p.name|Player (p) ∧ p.date_birth &lt;1980-01-01}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda601b6" class="outline-4">
<h4 id="orgda601b6">Cuantificadores [ELM16 8.6.3; ELM16 8.6.6]</h4>
<div class="outline-text-4" id="text-orgda601b6">
<p>
Pero, ¿cómo hacemos si queremos listar a los jugadores que hicieron algún gol
durante el mundial?
</p>

<p>
Necesitamos de los cuantificadores.
</p>
<ul class="org-ul">
<li>Cuantificador universal: (∀t)p(t). Es verdadero si para cualquier tupla t el
predicado p(t) es verdadero.</li>
<li>Cuantificador existencial: (∃t)p(t). Es verdadero si existe al menos una tupla
t para la cual el predicado p(t) es verdadero.</li>
</ul>

<p>
El listado de los nombres de los jugadores que hicieron goles se obtiene como:
</p>

<div class="org-src-container">
<pre class="src src-language">Respuesta
{p.name|Player (p) ∧ (∃s)(Score(s) ∧ s.player _id = p.id)}
</pre>
</div>

<p>
Atención! Una variable que fue cuantificada no puede aparecer seleccionada en el
lado izquierdo de la barra (|), y toda variable que aparece sólo en el lado
derecho debe estar cuantificada.
</p>
<ul class="org-ul">
<li>Las variables que fueron cuantificadas son variables ligadas.</li>
<li>Las variables que no fueron cuantificadas son variables libres.</li>
</ul>

<p>
Reiteramos:
</p>

<div class="org-src-container">
<pre class="src src-language">Una expresión del cálculo relacional de tuplas tiene la forma:
{t 1 .A 11 , t 1 .A 12 , ..., t 1 .A 1k 1 , ..., t n .A nk n |p(t 1 , t 2 , ..., t n , t n+1 , ..., t n+m )},
en donde p es un predicado válido. {t 1 , t 2 , ..., t n } deben ser
variables libres, y {t n+1 , t n+2 , ..., t n+m } deben ser variables ligadas.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Ejemplo: World Cup 2010
Liste los nombres de los jugadores de la Selección Española.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
{p.name|Player (p) ∧ (∃n)(NationalTeam(n)∧n.id = p.national_team ∧ n.name = “Spain”)}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Ejemplo: World Cup 2010
Liste el nombre del jugador más anciano del Mundial.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
{p.name|Player (p) ∧ (∀θ)(¬Player (θ)∨θ.birth_date ≥ p.birth_date)}
</pre>
</div>

<p>
Observemos que el cuantificador ∀θ necesita típicamente de una negación dentro
de su expresión, para restringir el universo de θ’s sobre los que requerimos que
la expresión sea verdadera. De lo contrario, el resultado estará vacío.
</p>
</div>
</div>

<div id="outline-container-org7fe3a45" class="outline-4">
<h4 id="org7fe3a45">Expresiones seguras [ELM16 8.6.8; SILB10 6.2.3]</h4>
<div class="outline-text-4" id="text-org7fe3a45">
<p>
No toda expresión válida del cálculo de tuplas es una expresión segura (safe
expression).
</p>

<p>
Por ejemplo, la expresión&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-language">{p.name|¬Player (p)}
</pre>
</div>

<p>
&#x2026; no es una expresión segura. Producirá una cantidad infinita de tuplas con
valores como “safsq” o 57.
</p>

<p>
Una expresión segura es aquella que garantiza formalmente que producirá una
cantidad finita de tuplas.
</p>

<p>
Puede probarse que ésto es equivalente a garantizar que los valores de los
atributos del resultado son parte del dominio de la expresión.
</p>

<p>
Ejemplos:
</p>
<ul class="org-ul">
<li>{p 1 .nombre|(∃p 2 )(Persona(p 2 ) ∧ p 2 .edad = p 1 .edad)}
<ul class="org-ul">
<li>X Expresión no segura</li>
<li>Probablemente queríamos
<ul class="org-ul">
<li>{p 1 .nombre|Persona(p 1 ) ∧ (∃p 2 )(Persona(p 2 ) ∧ p 2 .edad = p 1 .edad)}</li>
</ul></li>
</ul></li>
<li>{p 1 .nombre|Empleado(p 1 ) ∧ (6 ∃p 2 )(Empleado(p 2 ) ∧ p 2 .sueldo &gt; p 1 .sueldo)}
<ul class="org-ul">
<li>Expresión segura</li>
</ul></li>
<li>{t.nombre|¬((Cliente(t) ∧ Proveedor (t))}
<ul class="org-ul">
<li>Expresión no segura</li>
<li>Probablemente queríamos
<ul class="org-ul">
<li>{t.nombre|(Cliente(t) ∨ Proveedor (t)) ∧ ¬(Cliente(t) ∧ Proveedor (t))}</li>
</ul></li>
</ul></li>
</ul>

<p>
Recomendación: Cuidado cuando usamos cuantificadores ó negamos predicados!
</p>
</div>
</div>

<div id="outline-container-org46391d6" class="outline-4">
<h4 id="org46391d6">Ejercicio: Tenistas</h4>
<div class="outline-text-4" id="text-org46391d6">
<div class="org-src-container">
<pre class="src src-language">Tenistas(nombre_tenista, país, altura, diestro)
(‘Novak Djokovic’, ‘Serbia’, 1.88, True)
Torneos(nombre_torneo, tipo_torneo)
(‘Abierto de Australia’, ‘Grand Slam’)
Campeones(nombre_tenista, nombre_torneo, modalidad, año)
(‘Juan Martín del Potro’, ‘Torneo de Estocolmo’, ‘Single’, 2016)

Liste los nombres de los tenistas que ganaron todos los torneos de Grand Slam.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
{c.nombre_tenista|Campeones(c)∧
(∀t)(¬Torneos(t) ∨ t.tipo_torneo 6 = “Grand Slam”∨
(∃c 2 )(Campeones(c 2 )∧
c 2 .nombre_tenista = c.nombre_tenista∧
c 2 .nombre_torneo = t.nombre_torneo))}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc359d33" class="outline-3">
<h3 id="orgc359d33">Cálculo Relacional de Dominios</h3>
<div class="outline-text-3" id="text-orgc359d33">
</div>
<div id="outline-container-org9b7361f" class="outline-4">
<h4 id="org9b7361f">Predicados, operaciones y cuantificadores [ELM16 8.7]</h4>
<div class="outline-text-4" id="text-org9b7361f">
<p>
En el cálculo relacional de dominios las variables representan dominios, es
decir que hacen referencia a los atributos.
</p>

<p>
Un predicado simple es una función de un conjunto de dominios, cuyo resultado es
un valor de verdad (V ó F). Se admiten como predicados simples:
</p>
<ul class="org-ul">
<li>R(x 1 , x 2 , &#x2026;, x n ), en donde R(A 1 , A 2 , &#x2026;, A n ) es una relación</li>
<li>x i x j</li>
<li>x i c, con c ∈ dom(A i )</li>
<li>En donde debe ser un operador de comparación:
<ul class="org-ul">
<li>=, &ne;</li>
<li>&gt;, ≥, &lt;, ≤ (sólo para atributos cuyos dominios están ordenados)</li>
</ul></li>
</ul>

<p>
Las operaciones entre predicados admitidas son ∧, ∨, ¬.
</p>

<p>
Se utilizan los cuantificadores con las mismas reglas que en el
CRT.
</p>

<div class="org-src-container">
<pre class="src src-language">Una expresión del cálculo relacional de dominios tiene la forma:
{x 1 , x 2 , ..., x n |p(x 1 , x 2 , ..., x n , x n+1 , ..., x n+m )},
en donde p es un predicado válido. {x 1 , x 2 , ..., x n } deben ser
variables libres, y {x n+1 , x n+2 , ..., x n+m } deben ser variables
ligadas.
</pre>
</div>
</div>
</div>
