org/bdd/04_algebra_calculo_relacionales.org
*** Ejemplos
    #+BEGIN_SRC language
Ejemplo: World Cup 2010
Liste los nombres de los países que jugaron el Mundial 2010.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
{n|(∃i)(∃g)(∃s)(∃c)(NationalTeam(i, n, g, s, c))}
    #+END_SRC

    #+BEGIN_SRC language
Ejemplo: World Cup 2010
Liste los nombres de los jugadores nacidos antes de 1980.
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
{n|(∃i)(∃b)(∃h)(∃p)(∃l)(∃t)(∃s)(Player (i, n, b, h, p, l, t, s) ∧ b
<1980-01-01)}
    #+END_SRC

    #+BEGIN_SRC language

Ejemplo: RENAPER
Personas(DNI, nombre, género, fecha_nacimiento)
HijoDe(DNI_padre, DNI_hijo)
CasadaCon(DNI1, DNI2, fecha_matrimonio)
Liste a todos los hijos de “Abraham Simpson” (suponga que no hay dos
personas con ese nombre).
    #+END_SRC

    #+BEGIN_SRC language
Respuesta
{ h, n 1 |(∃d 1 )(∃g 1 )(∃f 1 )(∃d 2 )(∃n 2 )(∃g 2 )(∃f 2 )(∃p)
(Personas(d 1 , n 1 , g 1 , f 1 )∧ Personas(d 2 , n 2 , g 2 , f 2 )
∧HijoDe(p, h) ∧ n 2 = “Abraham Simpson” ∧ h = d 1 ∧ p = d2)}
    #+END_SRC

* Completitud Relacional
  E. Codd demostró la equivalencia entre el álgebra relacional básica y el cálculo
  relacional(restringido a operaciones seguras) .

  Esta equivalencia implica que ambos lenguajes tienen el mismo poder expresivo.
  - Toda consulta expresable a través del cálculo relacional es también expresable
    en el álgebra relacional básica y viceversa.

  #+BEGIN_SRC language
¿Cómo se demuestra esta equivalencia?
Mostrando que cada uno de los operadores del álgebra relacional
básica es expresable a través del cálculo relacional, y que una
expresión genérica segura del cálculo relacional es expresable
utilizando los operadores del álgebra relacional básica.
  #+END_SRC

  A su vez, se dice que un lenguaje es relacionalmente completo
  cuando tiene la misma capacidad expresiva que el cálculo
  relacional.
  - El álgebra relacional básica es relacionalmente completa.

* Bibliografía
  - [ELM16] Fundamentals of Database Systems, 7th Edition. R. Elmasri, S.
    Navathe, 2016. Capítulo 8

  - [SILB10] Database System Concepts, 6th Edition. A. Silberschatz, H. Korth, S.
    Sudarshan, 2010. Capítulo 6

  - [CONN15] Database Systems, a Practical Approach to Design, Implementation and
    Management, 6th Edition. T. Connolly, C. Begg, 2015. Capítulo 5
 

