bdd/04_algebra_calculo_relacionales.html

<div id="outline-container-org612f2ee" class="outline-4">
<h4 id="org612f2ee">Ejemplos</h4>
<div class="outline-text-4" id="text-org612f2ee">
<div class="org-src-container">
<pre class="src src-language">Ejemplo: World Cup 2010
Liste los nombres de los países que jugaron el Mundial 2010.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
{n|(∃i)(∃g)(∃s)(∃c)(NationalTeam(i, n, g, s, c))}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Ejemplo: World Cup 2010
Liste los nombres de los jugadores nacidos antes de 1980.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
{n|(∃i)(∃b)(∃h)(∃p)(∃l)(∃t)(∃s)(Player (i, n, b, h, p, l, t, s) ∧ b
&lt;1980-01-01)}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">
Ejemplo: RENAPER
Personas(DNI, nombre, género, fecha_nacimiento)
HijoDe(DNI_padre, DNI_hijo)
CasadaCon(DNI1, DNI2, fecha_matrimonio)
Liste a todos los hijos de “Abraham Simpson” (suponga que no hay dos
personas con ese nombre).
</pre>
</div>

<div class="org-src-container">
<pre class="src src-language">Respuesta
{ h, n 1 |(∃d 1 )(∃g 1 )(∃f 1 )(∃d 2 )(∃n 2 )(∃g 2 )(∃f 2 )(∃p)
(Personas(d 1 , n 1 , g 1 , f 1 )∧ Personas(d 2 , n 2 , g 2 , f 2 )
∧HijoDe(p, h) ∧ n 2 = “Abraham Simpson” ∧ h = d 1 ∧ p = d2)}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org5d800bf" class="outline-2">
<h2 id="org5d800bf">Completitud Relacional</h2>
<div class="outline-text-2" id="text-org5d800bf">
<p>
E. Codd demostró la equivalencia entre el álgebra relacional básica y el cálculo
relacional(restringido a operaciones seguras) .
</p>

<p>
Esta equivalencia implica que ambos lenguajes tienen el mismo poder expresivo.
</p>
<ul class="org-ul">
<li>Toda consulta expresable a través del cálculo relacional es también expresable
en el álgebra relacional básica y viceversa.</li>
</ul>

<div class="org-src-container">
<pre class="src src-language">¿Cómo se demuestra esta equivalencia?
Mostrando que cada uno de los operadores del álgebra relacional
básica es expresable a través del cálculo relacional, y que una
expresión genérica segura del cálculo relacional es expresable
utilizando los operadores del álgebra relacional básica.
</pre>
</div>

<p>
A su vez, se dice que un lenguaje es relacionalmente completo
cuando tiene la misma capacidad expresiva que el cálculo
relacional.
</p>
<ul class="org-ul">
<li>El álgebra relacional básica es relacionalmente completa.</li>
</ul>
</div>
</div>

<div id="outline-container-org81e8273" class="outline-2">
<h2 id="org81e8273">Bibliografía</h2>
<div class="outline-text-2" id="text-org81e8273">
<ul class="org-ul">
<li>[ELM16] Fundamentals of Database Systems, 7th Edition. R. Elmasri, S.
Navathe, 2016. Capítulo 8</li>

<li>[SILB10] Database System Concepts, 6th Edition. A. Silberschatz, H. Korth, S.
Sudarshan, 2010. Capítulo 6</li>

<li>[CONN15] Database Systems, a Practical Approach to Design, Implementation and
Management, 6th Edition. T. Connolly, C. Begg, 2015. Capítulo 5</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2020-05-01 11:27
</div>
</body>
</html>
